<template>
  <div class="section">
    <div class="container">
      <div class="content">
        <h2 class="title">TODO:</h2>
        <ol>
          <li><del>Подключить bulma, bulma-extensions</del></li>
          <li><del>Отображать селектор валюты, по-умолчанию USD</del></li>
          <li><del>Отображать инпут для поиска валют</del></li>
          <li><del>Отображать переключатель для ночного режима</del></li>
          <li><del>Отобразить логотипы</del></li>
          <li><del>Global Data</del></li>
          <li><del>Форматировать цифры</del></li>
          <li><del>Выделять цветами красный или зеленый в заввисимости от положительности или отрицательности значения</del></li>
          <li><del>Ограничить монеты в зависимости "Show items"</del></li>
          <li><del>Сделать зависимость данных от текущей валюты</del></li>
          <li><del>Переделать меню и джумботрон под https://wikiki.github.io/</del></li>
          <li><del>Переделать хедер: поднять гитхаб наверх</del></li>
          <li><del>Вынести меню в отдельный компонент</del></li>
          <li><del>Добавить шильдик "Made with Bulma"</del></li>
          <li><del>Добавить шильдик "By me a coffee"</del></li>
          <li><del>Сделать страницу Disclaimer</del></li>
          <li><del>Сделать страницу faq</del></li>
          <li><del>Выбор валюты перенести в хедер</del></li>
          <li><del>При загрузке приложения, проверить localStorage</del></li>
          <li><del>Если там есть монеты отобразить их, кнопку "Обновить" и дату последнего обновления</del></li>
          <li><del>Если нет, то подтягивать все данные по 100 монет в localStorage</del></li>
          <li><del>В FETCH_ALL если isForceUpdate = true, то предварительно сбросить данные по всем монетам</del></li>
          <li><del>Заливать сборку на github-pages</del></li>
          <li><del>Сокращать большие цифры под K, M, B. Показывать полные цифры в тултипах.</del></li>
          <li><del>Доделать пагинатор</del></li>
          <li><del>Сделать страницу конкретной монеты в тайлах https://bulma.io/documentation/layout/tiles/</del></li>
          <li><del>Баг на LastUpdated, если все монеты уже загружены... Начинает грузить с самого последней монеты</del></li>
          <li><del>Решить проблему обжорства скриптов: оптимизировать, попробовать вынести в отдельный поток сортировку</del></li>
          <li><del>Поправить баг с отображением очень маленьких цифр</del></li>
          <li><del>Сбрасывать на первую страницу при изменении perPage в пагинаторе</del></li>
          <li><del>Сбрасывать на первую страницу при Force Update</del></li>
          <li><del>Night mode</del></li>
          <li><del>Переделать некоторые цвета темной темы</del></li>
          <li>i18n</li>
          <li>Повесить лоадеры: при смене страницы и количества в пагинаторе</li>
          <li>Переделать фильтры: number_format, percent и currency с использованием Intl.NumberFormat</li>
          <li>Пофиксить по возможности задержку при работе большим количеством данных: getter - coinsToShow</li>
          <li>Компонент LastUpdated скрывать плавно через 3 секунды после обновления данных</li>
          <li>При смене текущей валюты, мержить данные, но не сбрасывать</li>
          <li>Прописать символы всех валют</li>
          <li>Сделать поиск по монетам</li>
          <li>Сделать страницу результатов поиска</li>
          <li>Сделать страницу конвертора</li>
          <li>Зафиксировать процент ширины колонок в таблице</li>
          <li>Адаптивный сайт</li>
          <li>Отрефакторить пагинатор</li>
          <li>Заюзать Page-loader</li>
          <li>Добавить системы аналитики</li>
        </ol>
      </div>
    </div>
  </div>
</template>
